# ValueAtPointBase Properties

---
The ValueAtPointBase type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ValueAtPointBase Class
Autodesk.Revit.DB Namespace